plachta-zabatt/ArduinoCore-samd/boards.txt
electroniccats_bastwan.name=BastWAN
electroniccats_bastwan.vid.0=0x04D8
electroniccats_bastwan.pid.0=0xEB68
electroniccats_bastwan.vid.1=0x04D8
electroniccats_bastwan.pid.1=0xEB68
electroniccats_bastwan.vid.2=0x04D8
electroniccats_bastwan.pid.2=0xEB68
electroniccats_bastwan.vid.3=0x04D8
electroniccats_bastwan.pid.3=0xEB68
electroniccats_bastwan.vid.4=0x04D8
electroniccats_bastwan.pid.4=0xEB68
electroniccats_bastwan.vid.5=0x04D8
electroniccats_bastwan.pid.5=0xEB68
electroniccats_bastwan.upload.maximum_size=253952
electroniccats_bastwan.build.mcu=cortex-m0plus
electroniccats_bastwan.build.mathlib=arm_cortexM0l_math
electroniccats_bastwan.build.f_cpu=48000000L
electroniccats_bastwan.build.usb_product="BastWAN"
electroniccats_bastwan.build.extra_flags=-D__SAMR34J18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
electroniccats_bastwan.build.usb_manufacturer="Electronic Cats"
electroniccats_bastwan.build.board=SAMD_ZERO
electroniccats_bastwan.build.core=arduino
electroniccats_bastwan.build.variant=bastwan
electroniccats_bastwan.build.variant_system_lib=
electroniccats_bastwan.build.vid=0x04D8
electroniccats_bastwan.upload.protocol=sam-ba
electroniccats_bastwan.bootloader.tool=arduino:openocd
electroniccats_bastwan.build.ldscript=flash_256KB.ld
electroniccats_bastwan.build.openocdscript=openocd_scripts/SAML21J18B.cfg
electroniccats_bastwan.bootloader.file=bastwan/bootloader-bast-wan-v3.4.0.bin
electroniccats_bastwan.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_bastwan.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_bastwan.menu.float.print=Print uses separate singles and doubles
electroniccats_bastwan.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_bastwan.menu.float.string=String uses separate singles and doubles
electroniccats_bastwan.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_bastwan.menu.float.both=Print & String use separate singles and doubles
electroniccats_bastwan.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_bastwan.menu.config.disabled=config.h disabled
electroniccats_bastwan.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_bastwan.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_bastwan.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_bastwan.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_bastwan.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_bastwan.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_bastwan.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_bastwan.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_bastwan.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_bastwan.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_bastwan.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_bastwan.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_bastwan.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_bastwan.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_bastwan.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_bastwan.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_bastwan.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_bastwan.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_bastwan.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_bastwan.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_bastwan.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_bastwan.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_bastwan.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_bastwan.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_bastwan.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_bastwan.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_bastwan.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_bastwan.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_bastwan.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_bastwan.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_bastwan.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_bastwan.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_bastwan.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_bastwan.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_bastwan.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_bastwan.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_bastwan.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_bastwan.menu.bootloader.8kb.upload.tool=bossac
electroniccats_bastwan.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_bastwan.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_bastwan.menu.bootloader.8kb.upload.native_usb=true
electroniccats_bastwan.menu.usb.cdc=CDC_ONLY
electroniccats_bastwan.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_bastwan.menu.usb.cdc.build.pid=0xEB68
electroniccats_bastwan.menu.usb.cdc_hid=CDC_HID
electroniccats_bastwan.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_bastwan.menu.usb.cdc_hid.build.pid=0xEB68
electroniccats_bastwan.menu.usb.withcdc=WITH_CDC
electroniccats_bastwan.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_bastwan.menu.usb.withcdc.build.pid=0xEB68
electroniccats_bastwan.menu.usb.hid=HID_ONLY
electroniccats_bastwan.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_bastwan.menu.usb.hid.build.pid=0xEB68
electroniccats_bastwan.menu.usb.nocdc=WITHOUT_CDC
electroniccats_bastwan.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_bastwan.menu.usb.nocdc.build.pid=0xEB68
electroniccats_bastwan.menu.usb.none=USB_DISABLED
electroniccats_bastwan.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_bastwan.menu.usb.none.build.pid=0xEB68

# Meow Meow Mini based on D11D14A (SOIC-20)
electroniccats_meowmeow_mini.name= Meow Meow Mini
electroniccats_meowmeow_mini.vid.0=0x1209
electroniccats_meowmeow_mini.pid.0=0xBAB5
electroniccats_meowmeow_mini.vid.1=0x1209
electroniccats_meowmeow_mini.pid.1=0xBAB5
electroniccats_meowmeow_mini.vid.2=0x1209
electroniccats_meowmeow_mini.pid.2=0xBAB5
electroniccats_meowmeow_mini.vid.3=0x1209
electroniccats_meowmeow_mini.pid.3=0xBAB5
electroniccats_meowmeow_mini.vid.4=0x1209
electroniccats_meowmeow_mini.pid.4=0xBAB5
electroniccats_meowmeow_mini.vid.5=0x1209
electroniccats_meowmeow_mini.pid.5=0xBAB5
electroniccats_meowmeow_mini.build.mcu=cortex-m0plus
electroniccats_meowmeow_mini.build.mathlib=arm_cortexM0l_math
electroniccats_meowmeow_mini.build.f_cpu=48000000L
electroniccats_meowmeow_mini.build.usb_product="Meow Meow Mini"
electroniccats_meowmeow_mini.build.usb_manufacturer="Electronic Cats"
electroniccats_meowmeow_mini.build.board=SAMD_ZERO
electroniccats_meowmeow_mini.build.core=arduino
electroniccats_meowmeow_mini.build.variant=meowmeow_mini
electroniccats_meowmeow_mini.build.variant_system_lib=
electroniccats_meowmeow_mini.build.vid=0x1209
electroniccats_meowmeow_mini.upload.protocol=sam-ba
electroniccats_meowmeow_mini.bootloader.tool=arduino:openocd
electroniccats_meowmeow_mini.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_meowmeow_mini.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_meowmeow_mini.menu.float.print=Print uses separate singles and doubles
electroniccats_meowmeow_mini.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_meowmeow_mini.menu.float.string=String uses separate singles and doubles
electroniccats_meowmeow_mini.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_meowmeow_mini.menu.float.both=Print & String use separate singles and doubles
electroniccats_meowmeow_mini.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_meowmeow_mini.menu.config.disabled=config.h disabled
electroniccats_meowmeow_mini.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_meowmeow_mini.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_meowmeow_mini.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_meowmeow_mini.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_meowmeow_mini.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_meowmeow_mini.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_meowmeow_mini.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_meowmeow_mini.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_meowmeow_mini.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_meowmeow_mini.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_meowmeow_mini.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_meowmeow_mini.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_meowmeow_mini.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_meowmeow_mini.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_meowmeow_mini.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_meowmeow_mini.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_meowmeow_mini.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_meowmeow_mini.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_meowmeow_mini.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_meowmeow_mini.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_meowmeow_mini.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_meowmeow_mini.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_meowmeow_mini.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_meowmeow_mini.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_meowmeow_mini.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_meowmeow_mini.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_meowmeow_mini.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_meowmeow_mini.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_meowmeow_mini.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_meowmeow_mini.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_meowmeow_mini.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_meowmeow_mini.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_meowmeow_mini.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_meowmeow_mini.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_meowmeow_mini.build.extra_flags=-D__SAMD11D14AS__ {build.usb_flags} -DARM_MATH_CM0PLUS
electroniccats_meowmeow_mini.build.ldscript=flash_16KB.ld
electroniccats_meowmeow_mini.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
electroniccats_meowmeow_mini.bootloader.file=zero/binaries/sam_ba_meowmeow_mini_SAMD11D14A.bin
electroniccats_meowmeow_mini.menu.bootloader.4kb=4KB_BOOTLOADER
electroniccats_meowmeow_mini.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
electroniccats_meowmeow_mini.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
electroniccats_meowmeow_mini.menu.bootloader.4kb.upload.tool=bossac
electroniccats_meowmeow_mini.menu.bootloader.4kb.upload.use_1200bps_touch=true
electroniccats_meowmeow_mini.menu.bootloader.4kb.upload.wait_for_upload_port=true
electroniccats_meowmeow_mini.menu.bootloader.4kb.upload.native_usb=true
electroniccats_meowmeow_mini.menu.bootloader.4kb.upload.maximum_size=12288
electroniccats_meowmeow_mini.menu.bootloader.0kb=NO_BOOTLOADER
electroniccats_meowmeow_mini.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
electroniccats_meowmeow_mini.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
electroniccats_meowmeow_mini.menu.bootloader.0kb.upload.tool=arduino:openocd
electroniccats_meowmeow_mini.menu.bootloader.0kb.upload.use_1200bps_touch=false
electroniccats_meowmeow_mini.menu.bootloader.0kb.upload.wait_for_upload_port=false
electroniccats_meowmeow_mini.menu.bootloader.0kb.upload.native_usb=false
electroniccats_meowmeow_mini.menu.bootloader.0kb.upload.maximum_size=16384
electroniccats_meowmeow_mini.menu.usb.cdc=CDC_ONLY
electroniccats_meowmeow_mini.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_meowmeow_mini.menu.usb.cdc.build.pid=0xBAB5
electroniccats_meowmeow_mini.menu.usb.cdc_hid=CDC_HID
electroniccats_meowmeow_mini.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_meowmeow_mini.menu.usb.cdc_hid.build.pid=0xBAB5
electroniccats_meowmeow_mini.menu.usb.withcdc=WITH_CDC
electroniccats_meowmeow_mini.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_meowmeow_mini.menu.usb.withcdc.build.pid=0xBAB5
electroniccats_meowmeow_mini.menu.usb.hid=HID_ONLY
electroniccats_meowmeow_mini.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_meowmeow_mini.menu.usb.hid.build.pid=0xBAB5
electroniccats_meowmeow_mini.menu.usb.nocdc=WITHOUT_CDC
electroniccats_meowmeow_mini.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_meowmeow_mini.menu.usb.nocdc.build.pid=0xBAB5
electroniccats_meowmeow_mini.menu.usb.none=USB_DISABLED
electroniccats_meowmeow_mini.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_meowmeow_mini.menu.usb.none.build.pid=0xBAB5


# CatWAN farmer

